public/man/man1/git-quiltimport.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-quiltimport.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-quiltimport.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-quiltimport - Applies a quilt patchset onto the current branch</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git quiltimport [--dry-run | -n] [--author &lt;author&gt;] [--patches &lt;dir&gt;]
                [--series &lt;file&gt;] [--keep-non-patch]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Applies a quilt patchset onto the current Git branch, preserving the
patch boundaries, patch order, and patch descriptions present in the
quilt patchset.</p>
<p>
For each patch the code attempts to extract the author from the patch
description. If that fails it falls back to the author specified with
–author. If the –author flag was not given the patch description is
displayed and the user is asked to interactively enter the author of the
patch.</p>
<p>
If a subject is not found in the patch description the patch name is
preserved as the 1 line subject in the Git description.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-n, –dry-run</p>
<blockquote>
<p>Walk through the patches in the series and warn if we cannot find all of
the necessary information to commit a patch. At the time of this writing
only missing author information is warned about.</p>
</blockquote>
<p>
–author <em>Author Name &lt;Author Email&gt;</em></p>
<blockquote>
<p>The author name and email address to use when no author information can
be found in the patch description.</p>
</blockquote>
<p>
–patches &lt;dir&gt;</p>
<blockquote>
<p>The directory to find the quilt patches.</p>
<p>
The default for the patch directory is <em>patches</em> or the value of the
<strong>$QUILT_PATCHES</strong> environment variable.</p>
</blockquote>
<p>
–series &lt;file&gt;</p>
<blockquote>
<p>The quilt series file.</p>
<p>
The default for the series file is &lt;patches&gt;/series or the value of the
<strong>$QUILT_SERIES</strong> environment variable.</p>
</blockquote>
<p>
–keep-non-patch</p>
<blockquote>
<p>Pass <strong>-b</strong> flag to <em>git mailinfo</em> (see *git-mailinfo*(1)).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
GIT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
